explainedCombustion/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.15;
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            compressible::epsilonWallFunction;
        value           uniform 0.15;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.15;
    }
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
