explainedCombustion/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
26600
(
0.000565443
0.000579402
0.000593361
0.00060732
0.000621279
0.000635238
0.000649197
0.000663156
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.00178565
0.00280634
0.0039607
0.00515979
0.00637841
0.0076072
0.00884191
0.0100804
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.00176404
0.00394771
0.00636833
0.00883318
0.0113134
0.0138007
0.0162918
0.0187852
...
)
;
    }
    fixedWalls
    {
        type            calculated;
        value           uniform 1e-15;
    }
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
