explainedCombustion/constant/reactions
species
(
    O2
    H2O
    CH4
    CO2
    N2
);

reactions
{
    methaneReaction
    {
        type     irreversibleArrheniusReaction;
        //type     irreversibleinfiniteReaction;
        reaction "CH4 + 2O2 = CO2 + 2H2O";
        
        // The following parameters are required only for irreversibleArrheniusReaction
        A        5.2e16;
        beta     0;
        Ta       14906;
    }
}

